saveDesign CHIP.inn
write_sdf CHIP.sdf
saveNetlist CHIP.v